## Part 1: Design an ERD

<img src='Data/EER_books.png'>

## Part 2: 
### Imports & getting logins

In [1]:
import pandas as pd
from sqlalchemy import text
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
#connection_str = "mysql+pymysql://root:Perfecto47@localhost/Books"

In [2]:
import json
with open('/Users/milkasantana/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

### Create the database in Python

In [3]:
#To make the connection between Python and MySQL
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

### Read all the files & create the tables in the database

In [5]:
df_clients = pd.read_csv('data/clients.csv')
df_clients.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [6]:
df_authors = pd.read_csv('data/authors.csv')
df_authors.to_sql('authors', con=engine, if_exists='replace', index=False)
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
df_books = pd.read_csv('data/books.csv')
df_books.to_sql('books', con=engine, if_exists='replace', index=False)
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [8]:
df_favorites = pd.read_csv('data/favorites.csv')
df_favorites.to_sql('favorites', con=engine, if_exists='replace', index=False)
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [9]:
df_users = pd.read_csv('data/users.csv')
df_users.to_sql('users', con=engine, if_exists='replace', index=False)
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

 ### Testing the Database

In [10]:
q = '''SHOW TABLES'''
pd.read_sql_query(sql=text(q), con=engine.connect())

  Tables_in_books
0         authors
1            book
2           books
3     client_book
4       favorites
5            user
6           users

In [11]:
from sqlalchemy import text

# Create a database connection
connection = engine.connect()

john_doe_favorites_query = text("""
    SELECT books.title
    FROM books
    JOIN favorites ON books.id = favorites.book_id
    WHERE favorites.user_id = (
        SELECT users.id
        FROM users
        WHERE users.last_name = 'Doe' AND users.first_name = 'John'
    );
""")

result = connection.execute(john_doe_favorites_query)

# Print the titles of John Doe's favorite books
for row in result:
    print(row[0])

The Shining
It
The Great Gatsby